title: T1086 Remote PowerShell Session
description: Detects remote PowerShell sessions
status: experimental
date: 2019/08/10
author: Roberto Rodriguez @Cyb3rWard0g
references:
    - https://threathunterplaybook.com/notebooks/windows/02_execution/WIN-190511223310.html
logsource:
    product: windows
    service: powershell
detection:
    selection: 
        EventID:
            - 4103
            - 400
        HostName: 'ServerRemoteHost'
        HostApplication: '*wsmprovhost.exe*'
    condition: selection
falsepositives:
    - Unknown
level: critical
