title: Processes Accessing the microphone and webcam
id: 29976992-e6d6-4fce-8f9d-e7b9be4efbb6
description: Potential adversaries accessing the microphone and webcam in an endpoint.
status: experimental
date: 2020/06/07
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
tags:
    - attack.collection
    - attack.t1123
references:
  - https://twitter.com/duzvik/status/1269671601852813320
  - https://medium.com/@7a616368/can-you-track-processes-accessing-the-camera-and-microphone-7e6885b37072
logsource:
    product: windows
    service: sysmon
detection:
    selection1:
        EventID:
            - 12
            - 13
            - 14
    selection2:
        TargetObject|contains: '\SOFTWARE\Microsoft\Windows\CurrentVersion\CapabilityAccessManager\ConsentStore\microphone\NonPackaged'
    selection3:
        TargetObject|contains: '\SOFTWARE\Microsoft\Windows\CurrentVersion\CapabilityAccessManager\ConsentStore\webcam\NonPackaged'
    condition: selection1 and (select2 or selection3)
falsepositives:
    - Unknown
level: critical