title: Non Interactive PowerShell Execution
id: 88ef0221-cf99-41c9-ac81-a609331bde92
description: Detects execution of PowerShell with not explorer.exe as a parent.
status: experimental
date: 2019/09/12
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
tags:
    - attack.execution
    - attack.t1059.001
references:
    - https://threathunterplaybook.com/notebooks/windows/02_execution/WIN-190410151110.html
logsource:
    product: windows
    service: sysmon
detection:
    selection: 
        EventID: 1
        Image: '*\powershell.exe'
    filter:
        ParentImage: '*\explorer.exe'
    condition: selection and not filter
falsepositives:
    - Unknown
level: critical
