title: Remote PowerShell Session
id: 2625c6b9-0a68-40e0-b334-5d06ea476e06
description: Detects remote PowerShell seccions by monitoring network outbount connections to ports 5985 or 5986 from not network service account
status: experimental
date: 2019/09/12
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
tags:
    - attack.execution
    - attack.t1059.001
references:
    - https://threathunterplaybook.com/notebooks/windows/02_execution/WIN-190511223310.html
logsource:
    product: windows
    service: sysmon
detection:
    selection: 
        EventID: 3
        DestinationPort:
            - 5985
            - 5986
    filter:
        User: 'NT AUTHORITY\NETWORK SERVICE'
    condition: selection and not filter
falsepositives:
    - Unknown
level: critical
