title: Alternate PowerShell Hosts
id: 7de38c40-5d64-457b-8a2f-b6c47dcd66e5
description: Detects alternate PowerShell hosts potentially bypassing detections looking for powershell.exe
status: experimental
date: 2019/09/12
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
tags:
    - attack.execution
    - attack.t1059.001
references:
    - https://threathunterplaybook.com/notebooks/windows/02_execution/WIN-190815181010.html
logsource:
    product: windows
    service: sysmon
detection:
    selection: 
        EventID: 17
        PipeName: '\PSHost*'
    filter:
        Image: '*\powershell.exe'
    condition: selection and not filter
falsepositives:
    - Unknown
level: critical
