title: T1112 Wdigest Registry Modification
description: Detects potential malicious modification of the property value of UseLogonCredential from HKLM:\SYSTEM\CurrentControlSet\Control\SecurityProviders\WDigest to enable clear-text credentials
status: experimental
date: 2019/09/12
author: Roberto Rodriguez @Cyb3rWard0g
references:
    - https://github.com/Cyb3rWard0g/ThreatHunter-Playbook/tree/master/playbooks/windows/02_execution/T1086_powershell/powershell_remote_session.md
logsource:
    product: windows
    service: sysmon
detection:
    selection_one: 
        EventID: 13
        TargetObject: '*WDigest\\UseLogonCredential'
    condition: selection
falsepositives:
    - Unknown
level: critical