title: Wmiprvse Spawning Process
id: 7a4dc669-c7a2-4262-bba2-c1dc04c46e7c
description: Detects wmiprvse spawning processes
status: experimental
date: 2019/08/15
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
tags:
    - attack.execution
    - attack.t1047
references:
    - https://threathunterplaybook.com/notebooks/windows/02_execution/WIN-190810201010.html
logsource:
    product: windows
    service: sysmon
detection:
    selection: 
        EventID: 1
        ParentImage:  '*WmiPrvSe.exe'
    filter:
        LogonId:  '0x3e7'
    condition: selection and not filter
falsepositives:
    - Unknown
level: critical
