title: T1086 PowerShell Execution
description: Detects execution of PowerShell
status: experimental
date: 2019/09/12
author: Roberto Rodriguez @Cyb3rWard0g
references:
    - https://threathunterplaybook.com/notebooks/windows/02_execution/WIN-190410151110.html
logsource:
    product: windows
    service: sysmon
detection:
    selection: 
        EventID: 17
        PipeName: '\PSHost*'
    condition: selection
falsepositives:
    - Unknown
level: critical
