title: T1047 Wmiprvse Spawning Process
id: 48a6f8c6-25a4-431b-a6fa-5b5a60b35298
description: Detects wmiprvse spawning processes
status: experimental
date: 2019/08/15
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
tags:
    - attack.execution
    - attack.t1047
references:
    - https://threathunterplaybook.com/notebooks/windows/02_execution/WIN-190810201010.html
logsource:
    product: windows
    service: security
detection:
    selection: 
        EventID: 4688
        ParentProcessName:  '*WmiPrvSe.exe'
    filter:
        TargetLogonId:  '0x3e7'
    condition: selection and not filter
falsepositives:
    - Unknown
level: critical
