title: DPAPI Domain Master Key Backup Attempt
id: 3d1d87d8-24c4-4b36-b80e-cd72885a2b13
description: Detects anyone attempting a backup for the DPAPI Master Key. This events gets generated at the source and not the Domain Controller.
status: experimental
date: 2019/08/10
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
tags:
    - attack.credential_access
    - attack.t1003.004
references:
    - https://threathunterplaybook.com/notebooks/windows/06_credential_access/WIN-190620024610.html
logsource:
    product: windows
    service: security
detection:
    selection: 
        EventID: 4692
    condition: selection
falsepositives:
    - Unknown
level: critical
