title: T1047 Wmiprvse Wbemcomn DLL Hijack
description: Detects a threat actor creating a file named `wbemcomn.dll` in the `C:\Windows\System32\wbem\` directory over the network for a WMI DLL Hijack scenario.
status: experimental
date: 2020/10/12
author: Roberto Rodriguez @Cyb3rWard0g
references:
    - https://threathunterplaybook.com/notebooks/windows/08_lateral_movement/WIN-201009173318.html
logsource:
    product: windows
    service: security
detection:
    selection: 
        EventID: 5145
        RelativeTargetName: '*\wbem\wbemcomn.dll'
    filter:
        SubjectUserName: '*$'
    condition: selection and not filter
falsepositives:
    - Unknown
level: critical