title: T1003 LSASS Access from Non System Account
description: Detects potential mimikatz-like tools accessing LSASS from non system account
status: experimental
date: 2019/06/20
author: Roberto Rodriguez @Cyb3rWard0g
references:
    - https://threathunterplaybook.com/notebooks/windows/06_credential_access/WIN-170105221010.html
tags:
    - attack.credential_access
    - attack.t1003
logsource:
    product: windows
    service: security
detection:
    selection: 
        EventID:
            - 4663
            - 4656
        ObjectType: 'Process'
        ObjectName: '*\lsass.exe'
    filter:
        SubjectUserName: '*$'
    condition: selection and not filter
falsepositives:
    - Unknown
level: critical
