title: T1000 AD Object WriteDAC Access
description: Detects WRITE_DAC access to a domain object
status: experimental
date: 2019/09/12
author: Roberto Rodriguez @Cyb3rWard0g
references:
    - https://threathunterplaybook.com/notebooks/windows/05_defense_evasion/WIN-190101151110.html
logsource:
    product: windows
    service: security
detection:
    selection_one: 
        EventID: 4662
        ObjectServer: 'DS'
        AccessMask: 0x40000
        ObjectType:
            - '19195a5b-6da0-11d0-afd3-00c04fd930c9'
            - 'domainDNS'
    condition: selection
falsepositives:
    - Unknown
level: critical
