title: DPAPI Domain Backup Key Extraction
id: 473b0a21-6d3d-4353-b680-75f63ba2b3da
description: Detects tools extracting LSA secret DPAPI domain backup key from Domain Controllers
status: experimental
date: 2019/06/20
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
tags:
    - attack.credential_access
    - attack.t1003.004
references:
    - https://threathunterplaybook.com/notebooks/windows/06_credential_access/WIN-190620024610.html
logsource:
    product: windows
    service: security
detection:
    selection: 
        EventID: 4662
        ObjectType: 'SecretObject'
        AccessMask: '0x2'
        ObjectName: 'BCKUPKEY'
    condition: selection
falsepositives:
    - Unknown
level: critical
