title: Active Directory Replication from Non Machine Account
id: d4d8ade8-9bbf-4be3-8138-051a6b4d9097
description: Detects potential abuse of Active Directory Replication Service (ADRS) from a non machine account to request credentials.
status: experimental
date: 2019/07/26
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
tags:
    - attack.credential_access
    - attack.t1003.006
references:
    - https://threathunterplaybook.com/notebooks/windows/06_credential_access/WIN-180815210510.html
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 4662
        AccessMask: '0x100'
        Properties: 
            - '*1131f6aa-9c07-11d1-f79f-00c04fc2dcd2*'
            - '*1131f6ad-9c07-11d1-f79f-00c04fc2dcd2*'
            - '*89e95b76-444d-4c62-991a-0facbeda640c*'
    filter:
        SubjectUserName: '*$'
    condition: selection and not filter
falsepositives:
    - Unknown
level: critical
