title: Active Directory Replication User Backdoor
id: 815109b2-32d4-436e-b958-1f3db41c3954
description: Detects modification of the security descriptor of a domain object to grant active directory replication permissions to any user
status: experimental
date: 2019/09/12
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
tags:
    - attack.defense_evasion
    - attack.t1222
references:
    - https://threathunterplaybook.com/notebooks/windows/05_defense_evasion/WIN-190101151110.html
logsource:
    product: windows
    service: security
detection:
    selection_one: 
        EventID: 5136
        AttributeLDAPDisplayName: 'ntsecuritydescriptor'
        AttributeValue:
            - '*1131f6aa-9c07-11d1-f79f-00c04fc2dcd2*'
            - '*1131f6ad-9c07-11d1-f79f-00c04fc2dcd2*'
            - '*89e95b76-444d-4c62-991a-0facbeda640c*'
    condition: selection
falsepositives:
    - Unknown
level: critical
