title: T1012 SAM Registry Hive Handle Request
description: Detects handles requested to SAM registry hive
status: experimental
date: 2019/08/12
author: Roberto Rodriguez @Cyb3rWard0g
references:
    - https://threathunterplaybook.com/notebooks/windows/07_discovery/WIN-190725024610.html
tags:
    - attack.discovery
    - attack.t1012
logsource:
    product: windows
    service: security
detection:
    selection: 
        EventID: 4656
        ObjectType: 'Key'
        ObjectName: '*\SAM'
    condition: selection
falsepositives:
    - Unknown
level: critical
