title: T1021 DCOM InternetExplorer.Application iertutil DLL Hijack
description: Detects a threat actor creating a file named `iertutil.dll` in the `C:\Program Files\Internet Explorer\` directory over the network for a DCOM InternetExplorer DLL Hijack scenario.
status: experimental
date: 2020/10/12
author: Roberto Rodriguez @Cyb3rWard0g
references:
    - https://threathunterplaybook.com/notebooks/windows/08_lateral_movement/WIN-201009183000.html
logsource:
    product: windows
    service: security
detection:
    selection: 
        EventID: 5145
        RelativeTargetName: '*\Internet Explorer\iertutil.dll'
    filter:
        SubjectUserName: '*$'
    condition: selection and not filter
falsepositives:
    - Unknown
level: critical